Revit 2024 API
ViewDisplayModel.SmoothEdges Property
 True to enable "smooth edge" (anti-aliasing) effect. False to disable it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool SmoothEdges { get; set; }
Visual Basic
Public Property SmoothEdges As Boolean
	Get
	Set
Visual C++
public:
property bool SmoothEdges {
	bool get ();
	void set (bool value);
}
See Also
ViewDisplayModel Class
Autodesk.Revit.DB Namespace